In [22]:
import pandas as pd

In [23]:
data = [['raj',34],['hari',64], ['vithal',94], ['ram',54]]

In [24]:
data

[['raj', 34], ['hari', 64], ['vithal', 94], ['ram', 54]]

In [25]:
pd.DataFrame(data,columns= ['Name','Marks'])

     Name  Marks
0     raj     34
1    hari     64
2  vithal     94
3     ram     54

In [26]:
data = {'a':[1,2,3],'b':[6,7,8]}

In [27]:
data

{'a': [1, 2, 3], 'b': [6, 7, 8]}

In [28]:
df = pd.DataFrame(data)

In [29]:
df

   a  b
0  1  6
1  2  7
2  3  8

In [30]:
import numpy as np

In [31]:
arr = np.array([[1,2],[5,6]])

In [32]:
df= pd.DataFrame(arr,columns = ['A','B'])

In [33]:
df

   A  B
0  1  2
1  5  6

In [35]:
pd.read_excel('data.xlsx')

      NAME SCHOOL  MARKS
0   Gaurav    SPS     44
1     Jack    UPS     78
2      Ram    WPS     54
3    Shyam    UIS     34
4      Raj    RTS     88
5     Raju    RRY     54
6  Shubham    LLR     22
7    Dhanu    BBC     99

In [44]:
df = pd.read_csv("data.csv")

In [45]:
df

      NAME SCHOOL  MARKS
0   Gaurav    SPS     44
1     Jack    UPS     78
2      Ram    WPS     54
3    Shyam    UIS     34
4      Raj    RTS     88
5     Raju    RRY     54
6  Shubham    LLR     22
7    Dhanu    BBC     99

In [46]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)

In [47]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [48]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [49]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [51]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [53]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [55]:
df.shape

(244, 7)